//========================================================================================================================
// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и
//на выходе показывает вторую цифру этого числа.
//========================================================================================================================

// 456 -> 5
// 782 -> 8
// 918 -> 1

Console.Clear();
Console.WriteLine("Введите трехзначное число");
string str = Console.ReadLine();
if (str.Length != 3)
{
    Console.WriteLine("Число не трехзначное");
    return;    
}
    Console.WriteLine(str[1]);